In [1]:
# importing dependencies
import pandas as pd
from sqlalchemy import create_engine

In [5]:
# reading in csv data
salaries_file = "../Resources/Salaries.csv"
salaries_raw_df = pd.read_csv(salaries_file)

teams_file = "../Resources/Teams.csv"
teams_raw_df = pd.read_csv(teams_file)

teams_fran_file = "../Resources/TeamsFranchises.csv"
teams_fran_raw_df = pd.read_csv(teams_fran_file)

master_file = "../Resources/Master.csv"
master_players_raw_df = pd.read_csv(master_file)

In [4]:
# previewing the salaries df 
# ["yearID","teamID","lgID","playerID","salary"]
salaries_raw_df.head(5)

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [29]:
# previewing the teams df 
# ['yearID', 'lgID', 'teamID', 'franchID', 'divID', 'Rank', 'G', 'Ghome', 'W', 'L', 'DivWin', 'WCWin', 'LgWin', 'WSWin', 'R', 'AB', 'H', '2B', '3B', 'HR', 'BB', 'SO', 'SB', 'CS', 'HBP', 'SF', 'RA', 'ER', 'ERA', 'CG', 'SHO', 'SV', 'IPouts', 'HA', 'HRA', 'BBA', 'SOA', 'E', 'DP', 'FP', 'name', 'park', 'attendance', 'BPF', 'PPF', 'teamIDBR', 'teamIDlahman45', 'teamIDretro

teams_raw_df.tail(10)

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
2795,2015,NL,NYN,NYM,E,1,162,81.0,90,72,...,131.0,0.986,New York Mets,Citi Field,2569753.0,94,92,NYM,NYN,NYN
2796,2015,NL,WAS,WSN,E,2,162,81.0,83,79,...,125.0,0.985,Washington Nationals,Nationals Park,2619843.0,102,99,WSN,MON,WAS
2797,2015,NL,MIA,FLA,E,3,162,81.0,71,91,...,162.0,0.987,Miami Marlins,Marlins Park,1752235.0,98,97,MIA,FLO,MIA
2798,2015,NL,ATL,ATL,E,4,162,81.0,67,95,...,186.0,0.985,Atlanta Braves,Turner Field,2001392.0,97,97,ATL,ATL,ATL
2799,2015,NL,PHI,PHI,E,5,162,81.0,63,99,...,145.0,0.981,Philadelphia Phillies,Citizens Bank Park,1831080.0,98,98,PHI,PHI,PHI
2800,2015,NL,LAN,LAD,W,1,162,81.0,92,70,...,133.0,0.988,Los Angeles Dodgers,Dodger Stadium,3764815.0,101,98,LAD,LAN,LAN
2801,2015,NL,SFN,SFG,W,2,162,81.0,84,78,...,145.0,0.987,San Francisco Giants,AT&T Park,3375882.0,99,97,SFG,SFN,SFN
2802,2015,NL,ARI,ARI,W,3,162,81.0,79,83,...,146.0,0.986,Arizona Diamondbacks,Chase Field,2080145.0,107,106,ARI,ARI,ARI
2803,2015,NL,SDN,SDP,W,4,162,81.0,74,88,...,138.0,0.985,San Diego Padres,Petco Park,2459742.0,98,97,SDP,SDN,SDN
2804,2015,NL,COL,COL,W,5,162,81.0,68,94,...,171.0,0.985,Colorado Rockies,Coors Field,2506789.0,119,118,COL,COL,COL

In [48]:
# experimenting with teams for certain year range
teams_df_raw_85_higher = teams_raw_df.loc[teams_raw_df["yearID"] > 1984]

wash = teams_raw_df.loc[teams_raw_df["teamID"] == "WAS"]

wash_85_higher = teams_df_raw_85_higher.loc[teams_raw_df["teamID"] == "WAS"]

In [49]:
# reindexing to get a unique team and franchise id for each year
team_name_year_table_indexing = teams_df_raw_85_higher.set_index(["yearID"],["teamID"])
team_name_year_table_test = team_name_year_table_indexing[['teamID','name','franchID']]
test_df_1 = team_name_year_table_test.reset_index()
team_name_year_table = test_df_1.set_index(['yearID','teamID'])
team_name_year_table

                               name franchID
yearID teamID
1985   ATL           Atlanta Braves      ATL
       BAL        Baltimore Orioles      BAL
       BOS           Boston Red Sox      BOS
       CAL        California Angels      ANA
       CHA        Chicago White Sox      CHW
...                             ...      ...
2015   LAN      Los Angeles Dodgers      LAD
       SFN     San Francisco Giants      SFG
       ARI     Arizona Diamondbacks      ARI
       SDN         San Diego Padres      SDP
       COL         Colorado Rockies      COL

[888 rows x 2 columns]

In [28]:
# previewing the teamsfranchises df 
# ['franchID', 'franchName', 'active', 'NAassoc]

teams_fran_raw_df.tail(10)

    franchID             franchName active NAassoc
110      WAS    Washington Senators      N     NaN
111      WBL   Washington Blue Legs    NaN     NaN
112      WES        Keokuk Westerns    NaN     NaN
113      WIL  Wilmington Quicksteps      N     NaN
114      WNA   Washington Nationals      N     NaN
115      WNL   Washington Nationals      N     NaN
116      WNT   Washington Nationals    NaN     NaN
117      WOR    Worcester Ruby Legs      N     NaN
118      WSN   Washington Nationals      Y     NaN
119      WST   Washington Statesmen      N     NaN

In [9]:
# previewing the Master df 
# ['playerID', 'birthYear', 'birthMonth', 'birthDay', 'birthCountry', 'birthState', 'birthCity', 'deathYear', 'deathMonth', 'deathDay', 'deathCountry', 'deathState', 'deathCity', 'nameFirst', 'nameLast', 'nameGiven', 'weight', 'height', 'bats', 'throws', 'debut', 'finalGame', 'retroID', 'bbrefID]

master_players_raw_df.head(5)

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,220.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [11]:
# transformation of salaries_raw_df
# ["yearID","teamID","lgID","playerID","salary"] - old column names

salaries_df_2 = salaries_raw_df.copy()
salaries_df_3 = salaries_df_2.rename(columns = {"yearID" : "year","lgID" : "leagueID"})

In [54]:
# reindexing for the merge with the teams_year_table
sal_year_team_ind = salaries_df_2.set_index(['yearID','teamID'])
sal_year_team_ind

              lgID   playerID    salary
yearID teamID
1985   ATL      NL  barkele01    870000
       ATL      NL  bedrost01    550000
       ATL      NL  benedbr01    545000
       ATL      NL   campri01    633333
       ATL      NL  ceronri01    625000
...            ...        ...       ...
2015   WAS      NL  treinbl01    512800
       WAS      NL  ugglada01    507500
       WAS      NL  werthja01  21000000
       WAS      NL  zimmejo02  16500000
       WAS      NL  zimmery01  14000000

[25575 rows x 3 columns]

In [55]:
# merging in the full team names to the salary table

salary_team_name_df_1 = sal_year_team_ind.merge(team_name_year_table,how="left",left_index=True,right_index=True)

salary_team_name_df_1

              lgID   playerID    salary                  name franchID
yearID teamID
1985   ATL      NL  barkele01    870000        Atlanta Braves      ATL
       ATL      NL  bedrost01    550000        Atlanta Braves      ATL
       ATL      NL  benedbr01    545000        Atlanta Braves      ATL
       ATL      NL   campri01    633333        Atlanta Braves      ATL
       ATL      NL  ceronri01    625000        Atlanta Braves      ATL
...            ...        ...       ...                   ...      ...
2015   WAS      NL  treinbl01    512800  Washington Nationals      WSN
       WAS      NL  ugglada01    507500  Washington Nationals      WSN
       WAS      NL  werthja01  21000000  Washington Nationals      WSN
       WAS      NL  zimmejo02  16500000  Washington Nationals      WSN
       WAS      NL  zimmery01  14000000  Washington Nationals      WSN

[25575 rows x 5 columns]

In [57]:
# reseting index of salaries df for csv export

salaries_team_name_df_final = salary_team_name_df_1.reset_index()

salaries_team_name_df_final

       yearID teamID lgID   playerID    salary                  name franchID
0        1985    ATL   NL  barkele01    870000        Atlanta Braves      ATL
1        1985    ATL   NL  bedrost01    550000        Atlanta Braves      ATL
2        1985    ATL   NL  benedbr01    545000        Atlanta Braves      ATL
3        1985    ATL   NL   campri01    633333        Atlanta Braves      ATL
4        1985    ATL   NL  ceronri01    625000        Atlanta Braves      ATL
...       ...    ...  ...        ...       ...                   ...      ...
25570    2015    WAS   NL  treinbl01    512800  Washington Nationals      WSN
25571    2015    WAS   NL  ugglada01    507500  Washington Nationals      WSN
25572    2015    WAS   NL  werthja01  21000000  Washington Nationals      WSN
25573    2015    WAS   NL  zimmejo02  16500000  Washington Nationals      WSN
25574    2015    WAS   NL  zimmery01  14000000  Washington Nationals      WSN

[25575 rows x 7 columns]

In [59]:
final_salaries_output_path = "output_csv/final_salaries_team_names_1985_to_2015.csv"
salaries_team_name_df_final.to_csv(final_salaries_output_path,index=False)